SM_для_EDT/src/Documents/vftРапортОПоврежденииНеисправности/vftРапортОПоврежденииНеисправности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>vftРапортОПоврежденииНеисправности</name>
  <basedOn>Document.впВыявленныеДефекты</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Статус2</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Механизм_Система</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобреноКолВоПозиций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказаноКуда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПоНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитанаПоНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыполнено</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументаРапортОПовреждении</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияДефекта</name>
    <type>
      <types>DocumentRef.впВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретениеЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаСнабжение</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТребуемыеДействия</name>
    <attributes>
      <name>НеобходимыеСЗЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимыеРаботы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КаталожныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявкиТС3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявкиТС3</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобходимыеРемонтыеРаботы</name>
    <attributes>
      <name>НеобходимыеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОписаниеНеисправностей</name>
    <attributes>
      <name>ОписаниеНеисправности</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Enums/vftСтатусыДокументаРапортОПовреждении/vftСтатусыДокументаРапортОПовреждении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументаРапортОПовреждении</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впВыявленныеДефекты/впВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впВыявленныеДефекты</name>
  <basedOn>Document.впВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.впВыявленныеДефекты</basedOn>
  <basedOn>Document.впАктОВыполненииЭтапаРабот</basedOn>
  <registerRecords>InformationRegister.впВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.впУсловияВыявленияДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстраненияДефекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.впВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.впПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.впОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.впКритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.впВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
        <types>DocumentRef.впВнешнееОснованиеДляРабот</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Documents/vftРапортОПоврежденииНеисправности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	Префикс =  Судно.КодБыстрогоВвода;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	vftОбщиеПроцедурыДокументовСервер.ПриКопировании(ЭтотОбъект,ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	 
	Если Номер = "" Тогда
		
		НомерРапорта =  1;
		
		НомерДокумента = Строка(НомерРапорта) + "/" + Формат(дата,"ДФ=yy") + "/" + Лев(Судно.КодБыстрогоВвода, 4);
		
		ЗапросНов = Новый Запрос;
		ЗапросНов.Текст = 
		"ВЫБРАТЬ
		|	vftРапортОПоврежденииНеисправности.Номер
		|ИЗ
		|	Документ.vftРапортОПоврежденииНеисправности КАК vftРапортОПоврежденииНеисправности
		|ГДЕ
		|	vftРапортОПоврежденииНеисправности.Номер = &НомерДокумента";
		
		ЗапросНов.УстановитьПараметр("НомерДокумента", НомерДокумента);
		
		ДокументыСНомером = ЗапросНов.Выполнить().Выгрузить();		
		
		Пока ДокументыСНомером.Количество() <> 0  Цикл
			
			НомерРапорта = НомерРапорта + 1;
			
			НомерДокумента = Строка(НомерРапорта) + "/" + Формат(дата,"ДФ=yy") + "/" + Лев(Судно.КодБыстрогоВвода, 4);
			
			ЗапросНов.УстановитьПараметр("НомерДокумента", НомерДокумента);
			
			ДокументыСНомером = ЗапросНов.Выполнить().Выгрузить();
		КонецЦикла;
		Номер =  НомерДокумента;
		
	КонецЕсли;	
	
	//МассивРеквизитовДляОбязательногоЗаполнения = Новый Массив;
	//
	//	
	//Если Статус <> Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик И 
	//	Статус <> Перечисления.vftСтатусыДокументаРапортОПовреждении.Отправлен  И 
	//	Статус <> Перечисления.vftСтатусыДокументаРапортОПовреждении.Рассмотрен  Тогда
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ДатаОткрытия");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ТипСерийногоНомера");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("Изготовитель");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОКапитана");
	//КонецЕсли; 
	//
	//Если Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Получен Тогда
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("Механик");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ДатаЗаявки");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ОдобреноКолВоПозиций");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ЗаказаноКуда");		
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ЗаявкаНомер");
	//КонецЕсли;	
	//
	//
	//Если Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Закрыт  Тогда		
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ОтветственныйПоНеисправности");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОКапитанаПоНеисправности");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("КемВыполнено");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ДатаВыполнения");
	//	
	//КонецЕсли; 
	//
	//Отказ = НЕ ПроверитьЗаполнение();
	//vftОбщиеПроцедурыДокументовСервер.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект,МассивРеквизитовДляОбязательногоЗаполнения, Отказ);	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// ++ rarus ilshill 12.01.2020		
	ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
	
	Если ИспользоватьФункционалСУБ Тогда
		
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		
		Если ТипДанныхЗаполнения = Тип("ДокументСсылка.впВыявленныеДефекты") Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	впВыявленныеДефекты.Ссылка                      КАК РегистрацияДефекта,
			|	впВыявленныеДефекты.Подразделение               КАК Судно,
			|	впВыявленныеДефекты.Ответственный               КАК Ответственный,
			|	впВыявленныеДефекты.Комментарий                 КАК Комментарий,
			|	впВыявленныеДефекты.Организация                 КАК Организация,
			|	впВыявленныеДефекты.ДефектВыявленВПроцессе      КАК ДефектВыявленВПроцессе,
			|	впВыявленныеДефекты.ДатаУстраненияДефекта       КАК ДатаУстраненияДефекта,
			|	впВыявленныеДефекты.СписокДефектов.(
			|		ДефектОписание                              КАК ОписаниеНеисправности
			|	)                                               КАК СписокДефектов
			|ИЗ
			|	Документ.впВыявленныеДефекты                    КАК впВыявленныеДефекты
			|ГДЕ
			|	впВыявленныеДефекты.Ссылка = &ДокументОснование";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			
			ТаблицаДефектов = Выборка.СписокДефектов.Выгрузить();
			
			ОписаниеНеисправности = ТаблицаДефектов[0].ОписаниеНеисправности; 
			
		КонецЕсли;
			
		рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);
		
	КонецЕсли;
		// -- rarus ilshill 12.01.2020
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// ++ rarus ilshill 12.01.2020
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
	
	Если ИспользоватьФункционалСУБ Тогда
		
		Если Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик Тогда 
			
			МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");   
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОткрытия");	
			МассивНепроверяемыхРеквизитов.Добавить("ЗаявкаНаСнабжение");
			МассивНепроверяемыхРеквизитов.Добавить("ОписаниеНеисправности"); 
			МассивНепроверяемыхРеквизитов.Добавить("КорректирующиеДействия"); 
			МассивНепроверяемыхРеквизитов.Добавить("ПредупреждающиеДействия");
			МассивНепроверяемыхРеквизитов.Добавить("КемВыполнено");

		КонецЕсли;
		
		Если ПриобретениеЗИП Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ЗаявкаНаСнабжение");
		КонецЕсли;
		
		МассивНепроверяемыхРеквизитов.Добавить("Механик");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаЗаявки");
		МассивНепроверяемыхРеквизитов.Добавить("ОдобреноКолВоПозиций");
		МассивНепроверяемыхРеквизитов.Добавить("ЗаказаноКуда");		
		МассивНепроверяемыхРеквизитов.Добавить("ЗаявкаНомер");
		МассивНепроверяемыхРеквизитов.Добавить("ОтветственныйПоНеисправности");
		МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитанаПоНеисправности");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВыполнения");
		МассивНепроверяемыхРеквизитов.Добавить("ТипСерийногоНомера");
		МассивНепроверяемыхРеквизитов.Добавить("Изготовитель");

	Иначе
		
		Если Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик Тогда 
			
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОткрытия");
			МассивНепроверяемыхРеквизитов.Добавить("ТипСерийногоНомера");
			МассивНепроверяемыхРеквизитов.Добавить("Изготовитель");
			МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");	
			
		КонецЕсли; 
		
		Если Статус =  Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик Или
			Статус =  Перечисления.vftСтатусыДокументаРапортОПовреждении.Отправлен	Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("Механик");
			МассивНепроверяемыхРеквизитов.Добавить("ДатаЗаявки");
			МассивНепроверяемыхРеквизитов.Добавить("ОдобреноКолВоПозиций");
			МассивНепроверяемыхРеквизитов.Добавить("ЗаказаноКуда");		
			МассивНепроверяемыхРеквизитов.Добавить("ЗаявкаНомер");
			
		КонецЕсли;	
		
		Если Статус = Перечисления.vftСтатусыДокументаРапортОПовреждении.Черновик Или 
			Статус =  Перечисления.vftСтатусыДокументаРапортОПовреждении.Отправлен Или
			Статус =  Перечисления.vftСтатусыДокументаРапортОПовреждении.Получен Тогда	
			
			МассивНепроверяемыхРеквизитов.Добавить("ОтветственныйПоНеисправности");
			МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитанаПоНеисправности");
			МассивНепроверяемыхРеквизитов.Добавить("КемВыполнено");
			МассивНепроверяемыхРеквизитов.Добавить("ДатаВыполнения");
			
		КонецЕсли; 

		МассивНепроверяемыхРеквизитов.Добавить("ЗаявкаНаСнабжение");
		МассивНепроверяемыхРеквизитов.Добавить("ОписаниеНеисправности"); 
		МассивНепроверяемыхРеквизитов.Добавить("КорректирующиеДействия"); 
		МассивНепроверяемыхРеквизитов.Добавить("ПредупреждающиеДействия");
		
	КонецЕсли;
				
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	// -- rarus ilshill 12.01.2020
	
КонецПроцедуры

#КонецЕсли
